HW5_УПРІС_changes
